사전지식
컴퓨터시스템입문 > structured programming 
c언어 > pointer 

pretest fail : c+이하 
1 structured 2문제
2 c 4문제
6항목에서 90%이하 fail 
재시험있음(시험치기 위해 특강 들어야됨 저녁 6시~9시 6~8주분량)
평가 수시평가항목에 반영 
재시험시 감점있음
28일 시험 31일 특강:3일 4일 7일 8일 10일(예상) 

배워야 할 것 
1 c언어
2 객체지향
3 STL
 
객체지향 
1 캡슐화
2 상속
3 다형성
캡슐화위주

중간/기말 전체 성적 나쁠시 재시험
성적 좋으면 재시험 안쳐도 됨
재시험시 감점있음
기말 재시험 1월말까지 가능

질문 밑 응답 2회 이상 홈페이지를 통해
중간고사까지 1회 기말고사까지 1화 채우지 못할 시 2% 감점
유용한 응답을 한 경우 가산점 부과 1%
교수응답없음(카톡으로 할 것) 

1주차
01-pretest1
02기초만있음pretest2
강의자리 순서대로 각각 테스트있음 
인터넷강의도 있음 
http://plms.pusan.ac.kr/mod/ubfile/view.php?id=227625
